In [1]:
import pandas as pd
import numpy as np
z1 = [1,np.nan, np.nan,4,5,np.nan,7,np.nan]
z2 = [1,1,1,1,2,2,2,2]
df1 = pd.DataFrame({'Cricket': z1,
                    'Tennis' : z2})

In [2]:
df1

   Cricket  Tennis
0      1.0       1
1      NaN       1
2      NaN       1
3      4.0       1
4      5.0       2
5      NaN       2
6      7.0       2
7      NaN       2

In [3]:
df1['Cricket'].fillna(df1.groupby(['Tennis'])['Cricket'].transform(np.mean),inplace=True)
df1

   Cricket  Tennis
0      1.0       1
1      2.5       1
2      2.5       1
3      4.0       1
4      5.0       2
5      6.0       2
6      7.0       2
7      6.0       2